---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.InsertableObject
source: html/35730b62-7de0-ac82-1db5-8cb92f4efa94.htm
---
# InsertableObject Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.